<h1 style="color:blue;">Problem Set-2</h1>
<span style="color:red;">Question 1</span><br>
Consider the following Python module:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2
After importing the module into the interpreter, you execute:
>>> b()
>>> b()
>>> b()
>>> a
?
What value is displayed when the last expression (a) is evaluated? Explain your
answer by indicating what happens in every executed statement.

In [1]:
a=0
def b():
 global a  #Using global variable a
 a = c(a)  # storing the return value into variable a
def c(a):
 return a + 2

In [2]:
b()

In [3]:
b()

In [4]:
b()

In [5]:
a

6

Answer: - The Last Value is 6. In the first executed statement b(), Function has used gloal variable a which goes to another function called c(). And in that function it returned 2 which stored in the a. So, a's value became 2. We have excuted b() for 3 times. So, a's value chaged from 0 to 6. 1 b() -> a=2 2 b() -> a=4 3 b() -> a=6

<span style="color:red;">Question 2</span><br>
Function fileLength(), given to you, takes the name of a file as input and returns
the length of the file:

In [6]:
def file_length(file_name):
    file = open(file_name)
    contents = file.read()
    file.close()
    print(len(contents))

In [7]:
def file_length(file_name):
    try:
        file = open(file_name)  #opening File 
        contents = file.read()  # Reading data of file
        file.close()
        print(len(contents))
    except FileNotFoundError:   # Exception type
        print('File '+file_name+' Not Found')

In [8]:
file_length('Problemset2Practice.ipynb')

555

In [9]:
file_length('Problemset2Practice.ipyn')

File Problemset2Practice.ipyn Not Found

<span style="color:red;">Question 3</span><br>
Write a class named Marsupial that can be used as shown below:
>>> m = Marsupial()
>>> m.put_in_pouch('doll')
>>> m.put_in_pouch('firetruck')
>>> m.put_in_pouch('kitten')
>>> m.pouch_contents()
['doll', 'firetruck', 'kitten']
Now write a class named Kangaroo as a subclass of Marsupial that inherits all the
attributes of Marsupial and also:
a. extends the Marsupial __init__ constructor to take, as input, the
coordinates x and y of the Kangaroo object,
b. supports method jump that takes number values dx and dy as input and
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and
c. overloads the __str__ operator so it behaves as shown below.

In [10]:
class  Marsupial:
    pouch = []   #List of pouch
    def put_in_pouch(self,item):   #function to add items
        self.pouch.append(item)
    def pouch_contents(self):      #Function to display items
        print(self.pouch)

In [11]:
m = Marsupial()              #Creating Object
m.put_in_pouch('doll')       #adding Item called doll
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()          # Display Content

['doll', 'firetruck', 'kitten']

In [12]:
class Kangaroo(Marsupial):  
    dx=0
    dy=0
    def __init__(self, dx,dy):  #initializing Class
        self.dx=dx              #Storing Cordinates
        self.dy=dy
    def __str__(self):
        return 'I am a Kangaroo located at coordinates ('+str(self.dx)+','+str(self.dy)+')'
    def jump(self,dx,dy):
        self.dx +=dx        #Moving Cordinates according given value
        self.dy +=dy

In [14]:
k = Kangaroo(0,0)        #Creating Object
print(k)

I am a Kangaroo located at coordinates (0,0)

In [15]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')

In [16]:
k.pouch_contents()

['doll', 'firetruck', 'kitten', 'doll', 'firetruck', 'kitten', 'doll', 'firetruck', 'kitten']

In [17]:
k.jump(1,0)   #moving Cordinates
k.jump(1,0)
k.jump(1,0)

In [18]:
print(k)

I am a Kangaroo located at coordinates (3,0)

<span style="color:red;">Question 5</span><br>
Write function collatz() that takes a positive integer x as input and prints the
Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying
this rule to the previous number x in the sequence:
x = {
𝑥/2 𝑖𝑓 𝑥 𝑖𝑠 𝑒𝑣𝑒𝑛
3𝑥 + 1 𝑖𝑓 𝑥 𝑖𝑠 𝑜𝑑d
Your function should stop when the sequence gets to number 1. Your
implementation must be recursive, without any loops.

In [19]:
def collatz(x):  #recursive Funtion
    print(x)     #printing the value
    if x%2== 0:   #Checking if the number is Even
        if x>1:
            x = int(x/2)
            collatz(x)  #calling function
    else:
        if x>1:        #checking if the number is greater than 1
            x = 3*(x)+1
            collatz(x)  #calling recursive function

In [20]:
collatz(5)

5
16
8
4
2
1

<span style="color:red;">Question 6</span><br>
Write a recursive method binary() that takes a non-negative
integer n and prints the binary representation of integer n.

In [21]:
def binary(n):  
    if(n > 1):  
        binary(n//2)  #digits after the decimal point are removed
    print(n%2, end=' ')  #printing the value

In [23]:
binary(3)

1 1

<span style="color:red;">Question 9</span><br>
Write SQL queries on the below database table that return:
a) All the temperature data.
b) All the cities, but without repetition.
c) All the records for India.
d) All the Fall records.
e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.
f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.
g) The total annual rainfall for Cairo.
h) The total rainfall for each season.

In [24]:
%load_ext sql  #load the sql extension

In [25]:
%sql sqlite:// #loading sqlite from sql

In [26]:
#creating table of temperature
%sql CREATE TABLE temperature(city varchar(50),country varchar(50), season varchar(50), temprature int(50), Rainfall int(50));

 * sqlite://
Done.

[]

In [27]:
#inserting all the values at once
%%sql 
INSERT INTO temperature VALUES('Mumbai','India','Winter','24.8','5.9');
INSERT INTO temperature VALUES('Mumbai','India','Spring','28.4','16.2');
INSERT INTO temperature VALUES('Mumbai','India','Summer','27.9','1549.4');
INSERT INTO temperature VALUES('Mumbai','India','Fall','27.6','346.0');
INSERT INTO temperature VALUES('London','United Kingdom','Winter','4.2','207.7');
INSERT INTO temperature VALUES('London','United Kingdom','Spring','8.3','169.6');
INSERT INTO temperature VALUES('London','United Kingdom','Summer','15.7','157.0');
INSERT INTO temperature VALUES('London','United Kingdom','Fall','10.4','218.5');
INSERT INTO temperature VALUES('Cairo','Egypt','Winter','13.6','16.5');
INSERT INTO temperature VALUES('Cairo','Egypt','Spring','20.7','6.5');
INSERT INTO temperature VALUES('Cairo','Egypt','Summer','27.7','0.1');
INSERT INTO temperature VALUES('Cairo','Egypt','Fall','22.2','4.5');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [28]:
#display All data of temperature table
%sql select * from temperature

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [29]:
#fetching data of India
%sql select * from temperature where country = 'India'

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

In [30]:
#Displaying Fall season's data
%sql select * from temperature where season='Fall'

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [31]:
#It will show the city ,country and season where rainfall was between 200 and 400
%sql select city,country,season from temperature where Rainfall Between 200 and 400

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [32]:
#This will display city and countries temperature which is above 2 in fall season in increasing order
%sql select city, country from temperature where season = 'Fall' and temprature > 20 order by Temprature ASC

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [33]:
#display Total rainfall in a year in Cairo city
%sql select SUM(Rainfall) as annualRainfall from temperature where city='Cairo'

 * sqlite://
Done.

[(27.6,)]

In [34]:
#Will show annual rainfall in each season 
%sql select season,SUM(Rainfall) as AnnuaRainfall from temperature group by season

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

<span style="color:red;">Question 10</span><br>
Suppose list words is defined as follows:
>>> words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']<br>
Write list comprehension expressions that use list words and generate the following
lists:<br>
a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE',
'LAZY', 'DOG']<br>
b) ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog']<br>
c) [3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list
words).<br>
d) [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN',
'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5],
['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy',
4], ['DOG', 'dog', 3]] (the list containing a list for every word of list
words, where each list contains the word in uppercase and lowercase and the
length of the word.)<br>
e) ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog'] (the list of words in list words containing 4 or more
characters.)<br>

In [36]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

In [37]:
list1 = [word.upper() for word in words]  #Convert words into uppercase

In [38]:
list1

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [39]:
list2 = [word.lower() for word in words] #Convert words into lowercase

In [40]:
list2

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [41]:
list3 = [len(word) for word in words] #store number of character of each word in the list

In [42]:
list3

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [43]:
list4 = [[word.upper(),word.lower(),len(word)] for word in words] #store uppercase,lowercase and numner of charaters in words list in list4

In [44]:
list4

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [45]:
list5 = [word for word in words if len(word)>=4] #store all the words who's lenth is 4 or more.

In [46]:
list5

['quick', 'brown', 'jumps', 'over', 'lazy']